{
	"intro": [
		"\"Morning lengzai! Welcome to our charity stall dedicated to fundraising for autism research.\"",
		"\"How may I help you? Anything from our talented children that interests you?\"",
		"\"...that CD case ah? We're not entirely sure what it is either.\"",
		"\"We were told it's a video game made by one of our clients' autistic child.\"",
		"\"But we don't have a computer with a CD reader on it, so what's inside we dunno lah.\"",
		"\"The fact that this was the only copy we were sent, we still don't understand.\"",
		"\"Haiyah, it got no use over here, we dunno what to do with it.\"",
		"\"Oh, you're interested in buying it? No need lah, I gift you for free.\"",
		"\"Thanks for coming!\""
	],
	"section_1": [
		"...someone actually bought this crappy game of mine? That was unexpected.",
		"Hello and welcome to my game, I guess. I'm the person who created this game.",
		"Sorry for inconveniencing you by putting this game inside of a CD.",
		"The organizer just so happened to not have an online store readily set up.",
		"Like, it's the 2020s, for fucks sake. No one physically distributes games anymore.",
		"Especially not in a non-gaming-oriented event, that's for sure."
	],
	"section_2": [
		"Genuine question though, what made you buy this game?",
		"This is no AAA release, nor is it an indie hit. Just a throwaway game made in 2 months.",
		"And it's sold in an awareness fair of all places. Isn't that weird?",
		"Probably not for me, I'm no stranger to all kinds of weird.",
		"So here I am, an autist making a game about autism for an audience that I'm not sure even exists.",
		"By the way, if you prefer me saying \"person with autism\"...",
		"...all I wanna say is that I just like saving 4 extra syllables."
	],
	"section_3": [
		"Regardless of whether you asked, I'm doing fine... at least on the outside.",
		"It's a different story on the inside. I feel... insignificant.",
		"What exactly could I achieve from making this game? What's the point?",
		"For one, I don't see this as an effective medium of promoting understanding.",
		"This game is inside a CD, for fucks sake. And I only made one copy. It's definitely becoming lost media.",
		"Besides, this is a 2D platformer. The most unimaginative, overdone kind of game one can think of.",
		"Not to mention people don't want to hear the narrator trauma dumping throughout the entire playthrough.",
		"...I seriously don't understand those who genuinely do. There's got to be a better use of your time.",
		"\"But you're creating good autism representation! This is honourable!\" Shut up.",
		"You don't play games for representation. You play games for fun, and this game has none of that.",
		"Therefore, this game is bad representation because it shows that AUTISTIC PEOPLE CAN'T MAKE GOOD GAMES!",
	],
	"section_4": [
		"...sorry about the rant just now, and sorry for dismissing the main reason you're playing this.",
		"I was massively insecure about myself when making this game. I'd just started out.",
		"Anyway, this fair that you bought this game from, the organizer's trying to promote \"awareness\".",
		"Sure, I think by now you're already aware of the word \"autism\".",
		"But you're *only* aware of the word \"autism\". You're most likely clueless about what it implies.",
		"Like, so far the public's knowledge on this topic is based on theories.",
		"Theories cobbled together from scientists working with a pigeon-holed understanding of autisitc children.",
		"And I was taught I was the one jumping to conclusions."
	],
	"section_5": [
		"Seriously, I've been blamed so many times for something I didn't intentionally do, it's easier to ask how often that's happening.",
		"Most of which are related to meltdowns, or \"temper tantrums\" as everyone used to misrefer it as.",
		"Ah yes, I'm in an emotionally vulnerable state while being hyperaware of everything, surely what I need is discipline or some shit.",
		"Fuck this slander. It's not like every neurotypical can withstand big emotions without falling apart.",
		"Besides, at least I'm aware of myself and have the decency to apologise.",
		"There are members of high society who can do neither. We all know who I'm talking about."
	],
	"section_6": [
		"I've also heard much about how you can supposedly grow out of autism.",
		"Those are hugeass lies. Autism isn't something you can simply grow out of.",
		"Trust me, I've tried. And it's definitely not just me who has dedicated their lives to trying.",
		"Not to mention the sheer amount of people only getting diagnosed after they'd grown up.",
		"What does that make them, some kind of Schrödinger's autist? I call bullshit.",
		"There are much more wrong about people's understanding that I can rant about here, but I won't have enough time to do that.",
		"For you're about to enter where all of this began, where all the misunderstandings originated from.",
	],
	"section_5A": [
		"Nevertheless, after extensive research efforts, they'd finally \"figured it out\".",
		"\"Those children with the 'autism', they're like a puzzle with missing pieces!\"",
		"\"And so it is our responsibility to assemble them back to human beings by any means!\"",
		"It wasn't just all talk, they even managed to develop various methods of \"treatment\".",
		
		
		"No wonder they call us \"children of the stars\".",
		"...wait, do they use this phrase anywhere else or is it just a Chinese thing?",
		"",
		"Not like it's any of my business since we don't even live on the same continent.",
		"To me, this is when all hell broke loose.",
	],
	"section_6": [
		"",
		"They were misled.",
	],
	"section_7": [
		"It was a massacre of minds, ",
		"They were afraid, they were overwhelmed, they were vulnerable.",
		"Even outside the many institutions, ridicule",
	],
	"section_8": [
		"\"The road to hell is paved with good intentions.\"",
		"I ended up growing up alongside those who were deemed as \"imbeciles\" as a result of ignorance.",
		"As much as they tried to help the world, they were misguided, and that costed a part of it.",
		"I'd grown much as years pass by, but the second I look back the kids stayed the same.",
		"\"Does change even exist?\" I asked myself, unaware of the ways the world has failed us.",
		"In the end I was alone, traversing through the human world as everyone else rotted behind the light of day."
	],
	"section_9": [
		"The Internet changed how I viewed myself and the world.",
		"Suddenly, I was exposed to many of my kind defining and talking about things I've experienced.",
		"I rejoiced as I learned more and more, but I slowly realized this isn't a global phenomenon.",
		"Lots of voices from the West, yet silence everywhere else. Why?",
		"Am I not looking hard enough? Or is the East still fast asleep?",
		"Is autism as an identity label really the way to go? Or is it just how Americans practice self-discovery?",
		"So many questions for no one to answer. Maybe this is the price of avantgarde.",
	],
	"ending": [
		"I'd be the first to admit that I have not made it out unscathed.",
		"It'll take time for me to make sense of everything, and there'll be a part of me in ruins.",
		"Still, I can now look past whatever outdated beliefs I was surrounded by.",
		"Am I proud to be autistic? I don't know. I don't think pride is the way to go for me.",
		"Rather, I want peace and neutrality with it. I'm tired from fighting against it for so long.",
		"Alas, I've just discovered a path to my future.",
		"All that's left is to follow it, and find myself in wherever it leads."
	],
}
